      *     コマンド電文
         03 SAMPLE-COMMAND.
      *       検索区分コード
      *       番号検索情報
           05 SEARCH-LIST-INFO                 OCCURS 5.
      *         顧客名1
             07 CUSTOMER-NAME1                 PIC G(20).
      *         顧客名2
             07 CUSTOMER-NAME2                 PIC G(20).
      *         顧客名3
             07 CUSTOMER-NAME3                 PIC G(20).
      *         顧客名4
             07 CUSTOMER-NAME4                 PIC G(20).
      *         顧客名5
             07 CUSTOMER-NAME5                 PIC G(20).
